/*
Задача 2. Порядок обхода (4 балла)
Обязательная задача
Дано число N < 106 и последовательность целых чисел из [-231..231] длиной N.
Требуется построить бинарное дерево, заданное наивным порядком вставки.
Т.е., при добавлении очередного числа K в дерево с корнем root, если root→Key ≤ K, то узел K добавляется в правое поддерево root; иначе в левое поддерево root.
Требования: Рекурсия запрещена. Решение должно поддерживать передачу функции сравнения снаружи.
2_1. Выведите элементы в порядке in-order (слева направо).

in
out

3
2 1 3
1 2 3

3
1 2 3
1 2 3

3
3 1 2
1 2 3

*/

#include <iostream>

int main()
{
    return 0;
}
